Интенсивное_обучение_программированию/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <comment>Приходная накладная от поставщика</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокМатериалов</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокРасходников</name>
    <attributes>
      <name>Расходник</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Интенсивное_обучение_программированию/src/Documents/ПриходнаяНакладная/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Договор = ДанныеЗаполнения.Договор;
		Поставщик = ДанныеЗаполнения.Поставщик;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаСписокМатериалов Из ДанныеЗаполнения.СписокМатериалов Цикл
			НоваяСтрока = СписокМатериалов.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокМатериалов.Количество;
			НоваяСтрока.Материал = ТекСтрокаСписокМатериалов.Материал;
			НоваяСтрока.Сумма = ТекСтрокаСписокМатериалов.Сумма;
			НоваяСтрока.Цена = ТекСтрокаСписокМатериалов.Цена;
		КонецЦикла;
		Для Каждого ТекСтрокаСписокРасходников Из ДанныеЗаполнения.СписокРасходников Цикл
			НоваяСтрока = СписокРасходников.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокРасходников.Количество;
			НоваяСтрока.Расходник = ТекСтрокаСписокРасходников.Расходник;
			НоваяСтрока.Сумма = ТекСтрокаСписокРасходников.Сумма;
			НоваяСтрока.Цена = ТекСтрокаСписокРасходников.Цена;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
